In [1]:
import pandas as pd

Loading the csv file and printing the first few rows.

In [2]:
df = pd.read_csv('UberDataset.csv')
df.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

Printing last few rows

In [3]:
df.tail()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

Check number of rows before cleaning

In [4]:
print(df.shape[0])  # Number of rows

1156

Remove the last row

In [5]:
# Remove the last row from the DataFrame
df = df.drop(df.index[-1])

# Reset the index
df.reset_index(drop=True, inplace=True)
# making sure last row was removed
df.tail()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
1150,12/31/2016 1:07,12/31/2016 1:14,Business,Kar?chi,Kar?chi,0.7,Meeting
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site

Check for duplicates

In [6]:
df[df.duplicated()]

          START_DATE         END_DATE  CATEGORY   START  STOP  MILES  PURPOSE
492  6/28/2016 23:34  6/28/2016 23:59  Business  Durham  Cary    9.9  Meeting

Remove duplicates

In [7]:
df.drop_duplicates(inplace=True)

Check if start date is equal to end date

In [8]:
df[df["START_DATE"]==df["END_DATE"]]

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
751,09-06-2016 17:49,09-06-2016 17:49,Business,Unknown Location,Unknown Location,69.1,NaN
761,9/16/2016 7:08,9/16/2016 7:08,Business,Unknown Location,Unknown Location,1.6,NaN
798,10-08-2016 15:03,10-08-2016 15:03,Business,Karachi,Karachi,3.6,NaN
807,10/13/2016 13:02,10/13/2016 13:02,Business,Islamabad,Islamabad,0.7,NaN

Remove these rows

In [9]:
df = df[df["START_DATE"] != df["END_DATE"]]

info method for overview

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1150 entries, 0 to 1154
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   START_DATE  1150 non-null   object
 1   END_DATE    1150 non-null   object
 2   CATEGORY    1150 non-null   object
 3   START       1150 non-null   object
 4   STOP        1150 non-null   object
 5   MILES       1150 non-null   float64
 6   PURPOSE     652 non-null    object
dtypes: float64(1), object(6)
memory usage: 71.9+ KB

Converting the start and end date into datetime format.

In [11]:
# Replace '-' with '/' in the 'START_DATE' and 'END_DATE' columns
df['START_DATE'] = df['START_DATE'].str.replace('-', '/')
df['END_DATE'] = df['END_DATE'].str.replace('-', '/')

# Convert 'START_DATE' and 'END_DATE' columns to datetime format
df['START_DATE'] = pd.to_datetime(df['START_DATE'], format='%m/%d/%Y %H:%M')
df['END_DATE'] = pd.to_datetime(df['END_DATE'], format='%m/%d/%Y %H:%M')

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1150 entries, 0 to 1154
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   START_DATE  1150 non-null   datetime64[ns]
 1   END_DATE    1150 non-null   datetime64[ns]
 2   CATEGORY    1150 non-null   object
 3   START       1150 non-null   object
 4   STOP        1150 non-null   object
 5   MILES       1150 non-null   float64
 6   PURPOSE     652 non-null    object
dtypes: datetime64[ns](2), float64(1), object(4)
memory usage: 71.9+ KB

Check for number of rows after cleaning

In [13]:

print(df.shape[0])  # Number of rows

1150

Add new column for the trip length

In [14]:
# Calculate trip length in minutes
df['TRIP_LENGTH_MINUTES'] = (df['END_DATE'] - df['START_DATE']).dt.total_seconds() / 60

In [15]:
df.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,TRIP_LENGTH_MINUTES
0,2016-01-01 21:11:00,2016-01-01 21:17:00,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,6.0
1,2016-01-02 01:25:00,2016-01-02 01:37:00,Business,Fort Pierce,Fort Pierce,5.0,NaN,12.0
2,2016-01-02 20:25:00,2016-01-02 20:38:00,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,13.0
3,2016-01-05 17:31:00,2016-01-05 17:45:00,Business,Fort Pierce,Fort Pierce,4.7,Meeting,14.0
4,2016-01-06 14:42:00,2016-01-06 15:49:00,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,67.0

In [16]:
df.describe(include='all')

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,TRIP_LENGTH_MINUTES
count,1150,1150,1150,1150,1150,1150.000000,652,1150.000000
unique,NaN,NaN,2,177,188,NaN,10,NaN
top,NaN,NaN,Business,Cary,Cary,NaN,Meeting,NaN
freq,NaN,NaN,1073,201,202,NaN,186,NaN
mean,2016-07-16 18:09:55.147826176,2016-07-16 18:33:14.504347904,NaN,NaN,NaN,10.538957,NaN,23.322609
min,2016-01-01 21:11:00,2016-01-01 21:17:00,NaN,NaN,NaN,0.500000,NaN,1.000000
25%,2016-03-31 13:14:30,2016-03-31 13:48:45,NaN,NaN,NaN,2.900000,NaN,10.000000
50%,2016-07-20 18:03:00,2016-07-20 18:08:30,NaN,NaN,NaN,6.000000,NaN,16.500000
75%,2016-10-28 08:02:00,2016-10-28 08:21:00,NaN,NaN,NaN,10.400000,NaN,28.000000
max,2016-12-31 22:08:00,2016-12-31 23:51:00,NaN,NaN,NaN,310.300000,NaN,336.000000
std,NaN,NaN,NaN,NaN,NaN,21.552360,NaN,27.343117

Fill NaN values in the purpose column

In [17]:
df['PURPOSE'] = df['PURPOSE'].fillna('(unknown purpose)')

Remove the start and stop column

In [18]:
df = df.drop(['START', 'STOP'], axis=1)

Determine which trips start and end on different dates to ensure that the trip length calculation works correctly in these cases as well

In [19]:
# Extract date part from 'START_DATE' and 'END_DATE' without hours
df['START_DATE_date'] = df['START_DATE'].dt.date
df['END_DATE_date'] = df['END_DATE'].dt.date

# Check if 'START_DATE' and 'END_DATE' are the same
dates_match = df['START_DATE_date'] == df['END_DATE_date']

# Print the rows where the dates do not match
print(df[~dates_match])
# Drop the temporary columns
df = df.drop(['START_DATE_date', 'END_DATE_date'], axis=1)

             START_DATE            END_DATE  CATEGORY  MILES  \
102 2016-02-13 23:45:00 2016-02-14 00:01:00  Personal    2.7
270 2016-03-25 22:54:00 2016-03-26 01:39:00  Business  201.0
298 2016-04-02 23:11:00 2016-04-03 01:34:00  Business  144.0
357 2016-05-05 23:55:00 2016-05-06 00:08:00  Business   12.9
406 2016-06-05 23:52:00 2016-06-06 00:08:00  Business    9.9
414 2016-06-07 23:41:00 2016-06-08 00:04:00  Business    9.9
425 2016-06-10 23:53:00 2016-06-11 00:01:00  Business    9.9
430 2016-06-11 23:39:00 2016-06-12 00:05:00  Business    9.9
498 2016-06-29 23:38:00 2016-06-30 00:00:00  Business    9.9
504 2016-07-01 23:48:00 2016-07-02 00:09:00  Business    9.9
506 2016-07-02 23:48:00 2016-07-03 00:12:00  Business    9.9
540 2016-07-12 23:47:00 2016-07-13 00:11:00  Personal    8.7
776 2016-09-27 21:01:00 2016-09-28 02:37:00  Business  195.6
813 2016-10-14 23:54:00 2016-10-15 02:06:00  Business   17.0

               PURPOSE  TRIP_LENGTH_MINUTES START_DATE_date END_DATE_date
102  (unknown purpose)                 16.0      2016-02-13    2016-02-14
270            Meeting                165.0      2016-03-25    2016-03-26
298            Meeting                143.0      2016-04-02    2016-04-03
357            Meeting                 13.0      2016-05-05    2016-05-06
406            Meeting                 16.0      2016-06-05    2016-06-06
414            Meeting                 23.0      2016-06-07    2016-06-08
425            Meeting                  8.0      2016-06-10    2016-06-11
430            Meeting                 26.0      2016-06-11    2016-06-12
498            Meeting                 22.0      2016-06-29    2016-06-30
504            Meeting                 21.0      2016-07-01    2016-07-02
506            Meeting                 24.0      2016-07-02    2016-07-03
540  (unknown purpose)                 24.0      2016-07-12    2016-07-13
776  (unknown purpose)                336.0      2016-09-27    2016-09-28
813            Meeting                132.0      2016-10-14    2016-10-15

Check for overall summary before proceeding

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1150 entries, 0 to 1154
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   START_DATE           1150 non-null   datetime64[ns]
 1   END_DATE             1150 non-null   datetime64[ns]
 2   CATEGORY             1150 non-null   object
 3   MILES                1150 non-null   float64
 4   PURPOSE              1150 non-null   object
 5   TRIP_LENGTH_MINUTES  1150 non-null   float64
dtypes: datetime64[ns](2), float64(2), object(2)
memory usage: 62.9+ KB

 Add new column for (parts of the day)

In [21]:
# Extract hour and minute from 'START_DATE'
df['HOUR_MINUTE'] = df['START_DATE'].dt.strftime('%H:%M')

# Map hours and minutes to parts of day
df['PARTS_OF_DAY'] = pd.to_datetime(df['HOUR_MINUTE'], format='%H:%M').dt.hour.apply(
    lambda x: (
        'Night' if 21 <= x <= 23 or 0 <= x < 5 else
        'Morning' if 5 <= x < 12 else
        'Afternoon' if 12 <= x < 17 else
        'Evening'
    )
)

# Drop the 'HOUR_MINUTE' column 
df = df.drop('HOUR_MINUTE', axis=1)

# Print the DataFrame with the new 'PARTS_OF_DAY' column
print(df)

              START_DATE            END_DATE  CATEGORY  MILES  \
0    2016-01-01 21:11:00 2016-01-01 21:17:00  Business    5.1
1    2016-01-02 01:25:00 2016-01-02 01:37:00  Business    5.0
2    2016-01-02 20:25:00 2016-01-02 20:38:00  Business    4.8
3    2016-01-05 17:31:00 2016-01-05 17:45:00  Business    4.7
4    2016-01-06 14:42:00 2016-01-06 15:49:00  Business   63.7
...                  ...                 ...       ...    ...
1150 2016-12-31 01:07:00 2016-12-31 01:14:00  Business    0.7
1151 2016-12-31 13:24:00 2016-12-31 13:42:00  Business    3.9
1152 2016-12-31 15:03:00 2016-12-31 15:38:00  Business   16.2
1153 2016-12-31 21:32:00 2016-12-31 21:50:00  Business    6.4
1154 2016-12-31 22:08:00 2016-12-31 23:51:00  Business   48.2

                PURPOSE  TRIP_LENGTH_MINUTES PARTS_OF_DAY
0        Meal/Entertain                  6.0        Night
1     (unknown purpose)                 12.0        Night
2       Errand/Supplies                 13.0      Evening
3               Meeting                 14.0      Evening
4        Customer Visit                 67.0    Afternoon
...                 ...                  ...          ...
1150            Meeting                  7.0        Night
1151     Temporary Site                 18.0    Afternoon
1152            Meeting                 35.0    Afternoon
1153     Temporary Site                 18.0        Night
1154     Temporary Site                103.0        Night

[1150 rows x 7 columns]

Check for info before saving the data

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1150 entries, 0 to 1154
Data columns (total 7 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   START_DATE           1150 non-null   datetime64[ns]
 1   END_DATE             1150 non-null   datetime64[ns]
 2   CATEGORY             1150 non-null   object
 3   MILES                1150 non-null   float64
 4   PURPOSE              1150 non-null   object
 5   TRIP_LENGTH_MINUTES  1150 non-null   float64
 6   PARTS_OF_DAY         1150 non-null   object
dtypes: datetime64[ns](2), float64(2), object(3)
memory usage: 71.9+ KB

Save the cleaned data into separate file

In [23]:
df.to_csv("cleaned.csv", index=False)

All visualization is done using Tableau.